Repository: 84000/data-translation-memory
Catalog: toh257-v4.tmx
Source language: bo
Languages: en

source: །དེར་བཅོམ་ལྡན་འདས་བཞུགས་ནས་འཛུམ་པ་མཛད་དེ། དེའི་ཞལ་གྱི་སྒོ་ནས་འོད་ཟེར་ཁ་དོག་སྔོན་པོ་དང་། སེར་པོ་དང་། དམར་པོ་དང་། དཀར་པོ་དང་། ལེ་བརྒན་དང་། ཤེལ་གྱི་ཁ་དོག་ལྟ་བུ་རྣམ་པ་སྣ་ཚོགས་བྱུང་ངོ་།
en: While sitting there, the Blessed One smiled, and various blue, yellow, red, white, violet, and crystalline light rays radiated from his mouth.

source: །འོད་ཟེར་དེ་དག་གཤེགས་ནས་བདུད་ཀྱི་གནས་བྱེ་བ་ཕྲག་བརྒྱ་དང་། བརྒྱ་བྱིན་གྱི་གནས་བྱེ་བ་ཕྲག་བརྒྱ་དང་། ཚངས་པའི་གནས་ཞེས་བྱ་བ་ནས་ལྷའི་དབང་པོ་ཐམས་ཅད་ཀྱི་གནས་དང་། ལྷ་མ་ཡིན་གྱི་གནས་དང་། དྲང་སྲོང་གི་གནས་བྱེ་བ་ཕྲག་བརྒྱའི་སངས་རྒྱས་ཀྱི་ཞིང་འདི་ཇི་སྙེད་པ་ཐམས་ཅད་དུ་འོད་ཟེར་དེ་དག་ཞུགས་སོ།
en: Those light rays spread out and pervaded all the buddha realms of the billions of abodes of Māra, Śakra, Brahmā, and everyone else, including the rulers of the gods, the asuras, and the sages.

source: །དེ་དང་དེ་དག་ཏུ་སེམས་ཅན་དབང་ཆེ་བར་གྲགས་པ་དབང་ཆེ་བར་གྲགས་པ་བདུད་དམ་ཞེས་བྱ་བ་ནས་དྲང་སྲོང་རྣམས་ཞེས་བྱ་བའི་བར་དུ་མིང་དུ་བཏགས་པ་དེ་དང་དེ་དག་ཐམས་ཅད་ལ་རབ་ཏུ་གོ་བར་མཛད་ནས་བདུད་ཅེས་བྱ་བ་ནས་དྲང་སྲོང་ཞེས་བྱ་བའི་བར་དེ་དང་དེ་དག་དེ་ནས་ཆས་ཏེ་བཅོམ་ལྡན་འདས་ག་ལ་བ་དང་། སངས་རྒྱས་ཀྱི་སྐུ་དྲུག་པོ་དེ་དག་ག་ལ་བར་སྐད་ཅིག་ཐང་ཅིག་ཡུད་ཙམ་ཅིག་གིས་འདིར་རི་རབ་ཀྱི་རྩེ་མོར་འཁོད་དོ།
en: In those abodes, all the beings renowned for their great power who were given the names Māra up to sages were touched by the light. They all left their abodes and instantly arrived at the summit of Mount Sumeru before the Blessed One and his six buddha emanations.

source: །བཅོམ་ལྡན་འདས་ཀྱིས་སྤྲུལ་པ་དག་རྒྱུན་བཅད་ནས་བཀའ་སྩལ་པ། ངའི་སངས་རྒྱས་ཀྱི་ཞིང་འདི་ན་རིའི་རྒྱལ་པོ་རི་རབ་བྱེ་བ་ཕྲག་བརྒྱ་ཇི་སྙེད་ཡོད་པ་ཐམས་ཅད་ཀྱི་ནང་ན་རི་རབ་འདི་ནི་མཆོག་དང་ཕུལ་ཡིན་པར་ངས་བཤད་དེ།
en: The Blessed One then ceased his emanations and declared, “Among all the billions of Mount Sumerus present in my buddha realm, I have explained that this Mount Sumeru is the most supreme and eminent.

source: རི་རབ་འདི་ནི་འདུས་པ་ཆེན་པོ་ཐམས་ཅད་ཀྱིས་ལོངས་སྤྱོད་པ་ཡིན་ཞིང་རི་རབ་ཐམས་ཅད་ཀྱི་རྒྱལ་པོ་ཡིན་ནོ།
en: All the great assemblies reside on this Mount Sumeru—it is the king of all Mount Sumerus!”

source: །དེ་ཐོས་ནས་བརྒྱ་བྱིན་ཀཽ་ཤི་ཀ་དང་ཞེས་བྱ་བ་ནས་མི་མཇེད་ཀྱི་བདག་པོ་ཚངས་པ་ཞེས་བྱ་བའི་བར་མཆོག་ཏུ་ཡིད་བདེ་བ་དང་རངས་པ་སྐྱེས་སོ།
en: When they heard this, Śakra (Kauśika) and everyone else including Brahmā, lord of the Sahā world, became elated and overjoyed.

source: །བཅོམ་ལྡན་འདས་ཀྱི་མཐུས་ཀླུའི་རྒྱལ་པོ་ཆེན་པོ་བཞི་པོ་དེ་དག་དྲང་སྲོང་ཐུབ་པའི་གནས་རྟེན་དེ་ནས་སོང་སྟེ།
en: Through the power of the Blessed One, the four great nāga kings then left the sacred site of wise sages.

source: ཀླུའི་རྒྱལ་པོ་རྒྱ་མཚོ་ནི་འདི་ནས་ལྷོ་ཕྱོགས་ཀྱི་རྒྱ་མཚོ་ཆེན་པོའི་ནང་དུ་མཇུག་མས་འདུག་ནས་རི་རབ་ཀྱི་རྩེ་མོའི་བར་དུ་དེའི་མགོ་བཞག་སྟེ་བཅོམ་ལྡན་འདས་འབའ་ཞིག་ལ་ལྟའོ་ཞེས་བྱ་བ་ནས་ཀླུའི་རྒྱལ་པོ་རིན་ཆེན་སྐྱོང་ཞེས་བྱ་བ་ནུབ་ཕྱོགས་ཀྱི་ཞེས་བྱ་བའི་བར་དང་། ཀླུའི་རྒྱལ་པོ་ལུས་འབིགས་པའི་ཁབ་ནི་བྱང་ཕྱོགས་ཀྱི་ཞེས་བྱ་བའི་བར་དང་། ཀླུའི་རྒྱལ་པོ་ཟླ་བ་ལ་རྩུབ་པ་ནི་ཤར་ཕྱོགས་ཀྱི་རྒྱ་མཚོ་ཆེན་པོའི་ནང་དུ་མཇུག་མ་བཞག་ནས་ཞེས་བྱ་བ་ནས་རི་རབ་ཀྱི་རྩེ་མོའི་བར་དུ་དེའི་མགོ་བཞག་སྟེ་བཅོམ་ལྡན་འདས་འབའ་ཞིག་ལ་ལྟའོ་ཞེས་བྱ་བའི་བར་དུའོ།
en: With his tail still resting in the great southern ocean, the nāga king Sāgara stretched his head up to the summit of Mount Sumeru, where he gazed one-pointedly at the Blessed One. Similarly, with their tails resting respectively in the great western, northern, and eastern oceans, the nāga kings Precious Protector, Body-Piercing Needle, and Harsh to the Moon stretched their heads up to the summit of Mount Sumeru, where they all gazed one-pointedly at the Blessed One.

source: །ཀླུ་ལྷག་མ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་དཔག་ཏུ་མེད་པ་དེ་དག་ནི་དེ་ནས་འདོང་བར་མ་ནུས་སོ། །དེ་དག་ཐམས་ཅད་ཀྱིས་གསང་བསྟོད་དེ་འདི་སྐད་ཅེས་སྨྲས་སོ། །བཙོན་ར་འདི་ནས་བདག་ཅག་ཡོངས་སུ་བསྐྱབ་པར་གསོལ། ཡོངས་སུ་ཐར་བར་མཛད་པར་གསོལ།
en: The remaining countless trillions of nāgas were unable to leave, and so they supplicated stealthily, “Please protect us and liberate us from this prison!”

source: ཀླུའི་རྒྱལ་པོ་དགའ་བོ་དང་ཉེ་དགའ་གཉིས་བཅོམ་ལྡན་འདས་རི་རབ་ཀྱི་རྩེ་མོ་ནས་འདིར་གཤེགས་ཤིང་གནས་རྟེན་འདིར་བཞུགས་ནས་ཀླུ་རྣམས་ལ་ཆོས་སྟོན་པར་འགྱུར་རོ་སྙམ་སྟེ། དེ་དག་གཉི་གས་གནས་རྟེན་ནས་རི་རབ་ཀྱི་རྩེ་མོའི་བར་དུ་དེ་སྲིད་ཀྱི་རང་གི་ལུས་སྤྲུལ་ཏོ།
en: The nāga kings Nanda and Upananda thought, “The Blessed One will descend to the ground from the summit of Mount Sumeru. He will then reside here and teach the Dharma to the nāgas.” With this in mind, they both stretched their own bodies from the ground all the way up to the summit of Mount Sumeru.

source: །དེ་ནས་བརྒྱ་བྱིན་འདི་སྙམ་དུ་སེམས་ཏེ། ཀླུ་དེ་དག་ནི་ལུས་རྩུབ་ཅིང་འདུས་ཏེ་རེག་ན་གདུག་པ་ཡིན་པས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ཀྱི་མཐིལ་དག་རལ་བར་གྱུར་ན་མི་རུང་ངོ་སྙམ་ནས། དེས་ལག་འགྲོའི་ལུས་ལྷ་རྫས་ཀྱི་རས་བཅོས་བུ་དག་གིས་ཡོངས་སུ་གཡོགས་ཤིང་མགོ་ལ་ཙན་དན་སྦྲུལ་གྱི་སྙིང་པོ་དང་ཏ་མ་ལའི་ལོ་མའི་ཕྱེ་མས་ཡོངས་སུ་གཡོགས་ཏེ་ལྷ་རྫས་ཀྱི་མེ་ཏོག་དག་མངོན་པར་གཏོར་ཏོ།
en: Śakra thought, “Oh! The bodies of those nāgas are rough and dangerous to touch. It would be terrible if they were to harm the soles of the Blessed One’s feet!” With this in mind, he then draped the bodies of the nāgas in divine fabrics, and their heads with powders made of the finest sandalwood and leaves of tamāla trees. He also tossed divine flowers onto them.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དྲང་སྲོང་ཐུབ་པའི་གནས་རྟེན་དེ་རྒྱར་དཔག་ཚད་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་བརྒྱད་ཅུ་རྩ་བཞི་པར་སྤྲུལ་ཏོ། །མི་མཇེད་ཀྱི་བདག་པོ་ཚངས་པས་དེའི་དབུས་སུ་ལྷ་རྫས་ཀྱི་རིན་པོ་ཆེའི་རས་བཅོས་བུ་དང་། རྒྱན་དང་། ནོར་བུ་དང་། རིན་པོ་ཆེ་རྣམས་ཀྱི་གདན་དག་བཏིང་ངོ་།
en: The Blessed One now expanded the size of the sacred site of wise sages to a width of eighty-four quintillion leagues, and in the middle of it Brahmā, lord of the Sahā world, spread cushions adorned with divine fabrics, ornaments, jewels, and precious gems.

source: །དེའི་ཚེ་བཅོམ་ལྡན་འདས་རི་རབ་ཀྱི་རྩེ་མོ་ལ་བཞུགས་ནས་ཀུན་ཤེས་ཀཽ་ཌི་ནྱ་ལ་བཀའ་སྩལ་པ། ཅི་ནས་ཀྱང་སངས་རྒྱས་ཀྱི་ཞིང་མི་མཇེད་ཐམས་ཅད་དུ་ཆུད་པ་ཐམས་ཅད་ཀྱིས་ཐོས་པར་དེ་ལ་སངས་རྒྱས་ཀྱི་ཡུལ་གྱི་ཆོ་འཕྲུལ་གྱི་བྱིན་གྱིས་རླབས་ཀྱི་སྟོབས་དེ་ལྟ་བུས་ཆོས་སྟོན་ཏེ།
en: At that moment, while sitting on the summit of Mount Sumeru, the Blessed One said to Ājñātakauṇḍinya, “I teach the Dharma through the magical and transformative power of the buddhas’ domain, so that everyone throughout the entire buddha realm of Sahā may hear it.

source: ཀཽ་ཌི་ནྱ་གང་མིག་གི་སྐྱེ་བ་དང་། གནས་པ་དང་། འབྱུང་བ་དང་། ཉེ་བར་ལེན་པ་ལ་མངོན་པར་ཞེན་པ་འདི་ནི་སྡུག་བསྔལ་གྱི་སྐྱེ་བའོ།
en: Kauṇḍinya, clinging to the arising, continuation, origination, and appropriation of the eye is the arising of suffering.

source: །འདི་ནི་ནད་དང་སྲིད་པའི་ཡན་ལག་རྣམས་ཀྱི་གནས་པའོ།
en: It is a disease and the perpetuation of the factors of existence.

source: །འདི་ནི་རྒ་ཤིའི་འབྱུང་བའོ།
en: It is the manifestation of old age and death.

source: །ཀཽ་ཌི་ནྱ་གང་རྣ་བ་དང་། སྣ་དང་། ལྕེ་དང་། ལུས་དང་། ཡིད་ཀྱི་སྐྱེ་བ་དང་། གནས་པ་དང་། འབྱུང་བ་དང་། ཉེ་བར་ལེན་པ་ལ་མངོན་པར་ཞེན་པ་འདི་ནི་སྡུག་བསྔལ་གྱི་སྐྱེ་བའོ།
en: Kauṇḍinya, clinging to the arising, continuation, origination, and appropriation of the ear, nose, tongue, body, and mind is the arising of suffering.

source: །འདི་ནི་ནད་དང་། སྲིད་པའི་ཡན་ལག་རྣམས་ཀྱི་གནས་པའོ།
en: It is a disease and the perpetuation of the factors of existence.

source: །ཀཽ་ཌི་ནྱ་གང་མིག་གི་འགོག་པ་དང་། ཉེ་བར་ཞི་བ་དང་། ནུབ་པ་དང་། ཉེ་བར་ལེན་པ་ཉེ་བར་ཞི་བ་འདི་ནི་སྡུག་བསྔལ་གྱི་འགོག་པའོ།
en: Kauṇḍinya, the cessation, pacification, disappearance, and pacification of the appropriation of the eye is the cessation of suffering.

source: །འདི་ནི་སྲིད་པའི་ཡན་ལག་རྣམས་ཀྱི་ཉེ་བར་ཞི་བའོ། །འདི་ནི་རྒ་ཤིའི་ནུབ་པའོ།
en: It is the pacification of the factors of existence and the disappearance of old age and death.

source: །ཀཽ་ཌི་ནྱ་གང་རྣ་བ་དང་། སྣ་དང་། ལྕེ་དང་། ལུས་དང་། ཡིད་ཀྱི་འགོག་པ་དང་། ཉེ་བར་ཞི་བ་དང་། ནུབ་པ་དང་། ཉེ་བར་ལེན་པ་རྣམ་པར་ཞི་བ་འདི་ནི་སྡུག་བསྔལ་གྱི་འགོག་པའོ།
en: Kauṇḍinya, the cessation, pacification, disappearance, and pacification of the appropriation of the ear, nose, tongue, body, and mind is the cessation of suffering.

source: །ཆོས་གང་གིས་ང་ལྷ་དང་བཅས་པ་དང་། ཚངས་པ་དང་བཅས་པ་དང་། དགེ་སྦྱོང་དང་། བྲམ་ཟེར་བཅས་པ་དང་། ལྷ་དང་མིར་བཅས་པའི་སྐྱེ་དགུའི་འཇིག་རྟེན་ན་ཕུལ་ཡིན་པར་གྲགས་པ་དང་། བྱམས་པ་ཆེན་པོས་མཆོག་ཡིན་པར་གྲགས་པ་དང་། སྙིང་རྗེ་ཆེན་པོས་དམ་པ་ཡིན་པར་གྲགས་པ་དང་། འཁོར་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པས་བླ་ན་མེད་པར་གྲགས་པ་དང་། སྦྱིན་པ་དང་། དུལ་བ་དང་། ཡང་དག་པར་སྡོམ་པ་རྣམས་ཀྱིས་སེམས་ཅན་ཐམས་ཅད་ལ་སེམས་སྙོམས་པར་གྲགས་པའི་ཆོས་ཀྱི་སྦྱིན་པ་དང་། དུལ་བ་དང་། ཡང་དག་པར་སྡོམ་པ་དང་། ཚངས་པའི་གནས་པ་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་ཡོངས་སུ་བསྒོམ་པའི་རྒྱུ་འཐུན་པའི་ཆོས་དེ་ནི་ངས་སེམས་ཅན་ཐམས་ཅད་ལ་རྒྱ་ཆེར་བསྟན་ཏོ། །གསལ་བར་མཛད་དོ།
en: “Within the world with its gods, Brahmā, spiritual practitioners, brāhmaṇas, gods, and humans, I have presented the Dharma and so have become renowned as the most eminent being. Through my great love I have become renowned as the most supreme being. Through my great compassion I have become renowned as a holy being. By transcending saṃsāra I have become renowned as the unsurpassed one. Through my generosity, discipline, and restraint I have become renowned as the one who is impartial toward all beings. That Dharma is the outcome of the cultivation of such generosity, discipline, and restraint, as well as sublime states and the eightfold path of the noble ones. That Dharma I have taught and elucidated to all beings on a vast scale.

source: །སྟོན་པ་ཐུགས་བརྩེ་བ་ཅན་ཕན་པར་བཞེད་པས་གང་ཉན་ཐོས་རྣམས་ལ་མཛད་པ་ནི་ངས་མཛད་ཟིན་ཏེ། ད་ཁྱེད་ཅག་གིས་བྱ་བ་ཡིན་ནོ།
en: Since the affectionate Teacher wishes to benefit others, I have performed my deeds toward the hearers. Now it is your turn to act!

source: །རྒ་ཤིའི་མཐར་དབྱུང་བའི་ཕྱིར་དགོན་པ་རྣམས་དང་། ཤིང་དྲུང་དང་། དུར་ཁྲོད་དང་། རི་དང་། རི་ཁྲོད་དང་། བས་མཐའི་གནས་མལ་དེ་དག་ཏུ་ཕྱིས་འགྱོད་པ་ཅན་དུ་གྱུར་ན་མི་རུང་གིས་སྒོམས་ཤིག །རྩོལ་ཅིག །ངེད་ཀྱིས་རྗེས་སུ་བསྟན་པ་ནི་འདི་ཡིན་ནོ།
en: Make sure you do not have any regrets in the future! Therefore, in order to eradicate old age and death, you must practice and exert yourselves in the wilderness, under trees, in charnel grounds, in the mountains, in hermitages, and in secluded places! This is my teaching.”

source: །བཅོམ་ལྡན་འདས་ཀྱིས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་བཤད་པ་ན། སངས་རྒྱས་ཀྱི་ཞིང་མི་མཇེད་འདིའི་གླིང་བཞི་པ་བྱེ་བ་ཕྲག་བརྒྱ་གང་ཡིན་པ་ཐམས་ཅད་དུ་གླིང་བཞི་པ་རེ་རེར་ཡང་སེམས་ཅན་དཀྲིགས་པ་བྱེ་བ་བརྒྱ་སྟོང་ཕྲག་མང་པོ་དེ་དག་གིས་ནི་དགེ་བའི་རྩ་བ་རྣམ་པ་སྣ་ཚོགས་བསྐྱེད་དོ།
en: When the Blessed One delivered this Dharma teaching, myriads of sentient beings in each of the four continents in all the billions of four-continent worlds in this buddha realm of Sahā generated a variety of roots of virtue.

source: །ཁ་ཅིག་ནི་ཏིང་ངེ་འཛིན་དང་། གཟུངས་དང་། བཟོད་པ་རྣམས་ལ་རྣམ་པར་གནས་པར་གྱུར་ཏོ།
en: Some settled within states of absorption, retention, and acceptance.

source: །དེ་བཞིན་དུ་ཆོས་རྣམས་ལ་ཆོས་ཀྱི་མིག་བསྐྱེད་དོ།
en: Likewise, some gave rise to the Dharma eye with respect to phenomena.

source: །ཁ་ཅིག་ནི་སེམས་ཅན་དམྱལ་བར་འགྲོ་བའི་ལས་ཀྱི་སྒྲིབ་པ་རྣམས་བྱང་ངོ་ཞེས་བྱ་བ་ནས་ཁ་ཅིག་ནི་སེམས་ཅན་དམྱལ་བ་དང་། དུད་འགྲོའི་བར་དང་། ཁ་ཅིག་གནོད་སྦྱིན་དབུལ་པོ་ཉིད་ཀྱི་བར་དང་། ཁ་ཅིག་ནི་མི་དབུལ་པོ་ཉིད་དུ་འགྲོ་བའི་ལས་ཀྱི་སྒྲིབ་པ་རྣམས་ཡོངས་སུ་བྱང་ངོ་།
en: In some the karmic obscurations that would have led them to the hell realms were purified. In others the karmic obscurations that would have led them to be born into the hell realms, as animals or destitute yakṣas, or as poor humans were purified.

source: །ནད་ཀྱིས་བཏབ་པ་རྣམས་ནི་ནད་མེད་པར་གྱུར་ཏོ། །སེམས་ཅན་རྣམས་བཙོན་ར་ནས་ཡོངས་སུ་ཐར་བར་གྱུར་ཏོ།
en: Those who were afflicted by diseases recovered their health, and sentient beings were liberated from their prisons.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ལ་ཀླུའི་རྒྱལ་པོ་རྒྱ་མཚོས་ཚིགས་སུ་བཅད་དེ་གསོལ་པ།
en: The nāga king Sāgara then uttered these verses to the Blessed One:

source: དགེ་བ་སྣ་ཚོགས་དྲི་མ་མེད་པའི་གསེར་ཅན་སྤྱོད་པ་རྣམ་དག་ཐུགས་རྗེས་ཕྱུག །ལྷ་དང་ཤེད་ལས་སྐྱེས་དང་ལག་འགྲོའི་དམ་པ་ཉོན་མོངས་རྙོག་པ་སེལ་མཛད་པ།
en: “You are endowed with an abundance of virtue, Pure golden conduct, and immaculate compassion. Sublime among gods, humans, and nāgas, You clear away the mud of their afflictions.

source: །ཚུལ་ཁྲིམས་ཐོས་རིག་གསུམ་པོ་ཕུན་སུམ་ཚོགས་པ་སེམས་ཅན་ཐམས་ཅད་འཛུད་པའོ།
en: You fully establish all sentient beings On the paths of discipline, erudition, and knowledge.

source: །ལག་འགྲོའི་ཚོགས་རབ་ཐར་མཛད་ཐུགས་རྗེ་བརྟན་པོ་སྔོན་གྱི་དམ་བཅས་དགོངས་པར་མཛོད།
en: Please liberate those groups of nāgas! With your firm compassion, remember your past commitments!

source: །གཞན་སེམས་སེམས་ཅན་སླད་དུ་སྡུག་བསྔལ་ཇི་ལྟར་གཏར་བ་བཞིན།
en: “For the sake of other beings’ minds, You relinquish their suffering. Just so, the nāgas in this place are endlessly afflicted

source: །ལག་འགྲོའི་སྐད་ཅིག་མཐའ་ཡས་འདིར་རྨོངས་སྡུག་བསྔལ་སྣ་ཚོགས་ཐེབས།
en: By much suffering caused by delusion.

source: །དགྲ་ཡིས་ཕྱག་བགྱིས་བརྩོན་བརྟན་སྐྱེ་བའི་དགོན་པ་ལས་གྲོལ་བ།
en: “Your enemies pay homage to you, your diligence is firm, And you are free from the jungle of birth.

source: །ཡེ་ཤེས་ཆབ་ཀྱིས་ལག་འགྲོ་ཐམས་ཅད་ཚིམ་པར་མཛད་དུ་གསོལ།
en: Please satisfy all the nāgas With the water of wisdom!”

source: །འཕགས་པ་འདུས་པ་ཆེན་པོ་ཐེག་པ་ཆེན་པོའི་མདོ་ཉི་མའི་སྙིང་པོའི་ལེའུ་བཅུ་གཅིག་པ་ལས་རི་རབ་ལ་གཤེགས་པའི་ལེའུ་སྟེ་བཅུ་པའོ།། །།འཕགས་པ་ཤིན་ཏུ་རྒྱས་པ་ཆེན་པོའི་སྡེ་ཉི་མའི་སྙིང་པོ་ཞེས་བྱ་བའི་མདོ།
en: This concludes the chapter called “The Travel to Mount Sumeru,” the tenth among the eleven chapters included in “The Quintessence of the Sun,” the noble Great Vehicle discourse of The Great Assembly.

source: དེ་ནས་བཅོམ་ལྡན་འདས་མེ་ཏོག་དང་། རིན་པོ་ཆེ་དང་། ཆོས་གོས་དག་གི་ཆར་རབ་ཏུ་འབེབས་ཤིང་། སིལ་སྙན་དང་། ཕེག་རྡོབ་པ་དང་། གླུ་དབྱངས་དག་གི་རོལ་མོའི་སྒྲ་འབྱིན་པའི་ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། ལྷ་མ་ཡིན་ཐམས་ཅད་སྡོད་པས་རི་རབ་ཀྱི་རྩེ་མོ་ནས་གཤེགས་ཏེ།
en: While showering rains of flowers, precious gems, and Dharma robes, playing instruments and drums, and singing melodious songs, all the gods, nāgas, yakṣas, and asuras present there departed from the summit of Mount Sumeru together with the Blessed One.

source: བཅོམ་ལྡན་འདས་ཉན་ཐོས་ཀྱི་དགེ་འདུན་གྱིས་མདུན་དུ་བདར་ཅིང་བྱང་ཆུབ་སེམས་དཔའི་དགེ་འདུན་གྱིས་ཡོངས་སུ་བསྐོར་ནས་དྲང་སྲོང་ཐུབ་པའི་གནས་རྟེན་གྱི་དབུས་སུ་གདན་བཏིང་བ་ཉིད་ལ་བཞུགས་སོ།
en: Attended by his saṅgha of hearers and surrounded by his saṅgha of bodhisattvas, the Blessed One then took a seat on the cushions that had been prepared for him at the center of the sacred site of wise sages.

source: །བཅོམ་ལྡན་འདས་ལ་མཆོད་པའི་ལས་བྱ་བའི་ཕྱིར་སྟེང་གི་ནམ་མཁའ་ལ་ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། ལྷ་མ་ཡིན་དང་། མི་འམ་ཅི་ཐམས་ཅད་ཀྱིས་རྒྱན་དང་། ཕྱེ་མ་སྣ་ཚོགས་དང་། མེ་ཏོག་སྣ་ཚོགས་དང་། རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱི་ཆར་རབ་ཏུ་ཕབ་བོ།
en: To worship the Blessed One, all the gods, nāgas, yakṣas, asuras, and kinnaras showered rains of various ornaments, powders, flowers, and precious gems from the sky.

source: །བཅོམ་ལྡན་འདས་ལ་ཀླུ་དེ་དག་གིས་ཀྱང་མེ་ཏོག་སྣ་ཚོགས་དང་། དྲི་སྣ་ཚོགས་དང་། རིན་པོ་ཆེ་སྣ་ཚོགས་དང་། རས་གོས་དང་། རས་བཅོས་བུ་དང་། ཆོས་གོས་དང་། རྒྱན་སྣ་ཚོགས་ཀྱིས་མཆོད་པ་བྱས་ནས་ལན་གསུམ་བསྐོར་བ་བྱས་ཏེ། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་གཉིས་ལ་མགོ་བོས་ཕྱག་འཚལ་ནས་སྤྱན་སྔར་ཆོས་མཉན་པའི་ཕྱིར་འཁོད་དོ།
en: The nāgas also offered the Blessed One different kinds of flowers, perfumes, precious gems, silken clothes, fine fabrics, Dharma robes, and ornaments. They circumambulated him three times, prostrated to his feet, and sat in front of him to listen to the Dharma.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ལ་ཀླུའི་རྒྱལ་པོ་རྒྱ་མཚོས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཙུན་པ་བཅོམ་ལྡན་འདས་སུག་ལས་གང་དག་གིས་སེམས་ཅན་རྣམས་ཀླུའི་སྐྱེ་གནས་སུ་སྐྱེ་ལགས།
en: The nāga king Sāgara then asked, “Respected Blessed One, what are the deeds through which sentient beings are born as nāgas?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཀླུའི་བདག་པོ་ལས་ཀྱི་སྒྲིབ་པ་བཅུས་སེམས་ཅན་འབྱུང་པོ་རྣམས་མྱུར་དུ་ཀླུའི་སྐྱེ་གནས་སུ་སྐྱེའོ།
en: The Blessed One replied, “Nāga lord, there are ten types of karmic obscurations through which beings will quickly be born as nāgas.

source: །བཅུ་གང་ཞེ་ན།
en: What are those ten?

source: སེམས་ཅན་གང་དག་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ལ་མངོན་པར་བརྩོན་ཞིང་བླ་ན་མེད་པའི་ཐེག་པ་ཡོངས་སུ་ཚོལ་བའི་སེམས་དང་ལྡན་པ་དག་ཡིན་ལ་མྱུར་དུ་འདོད་པ་རྣམས་ལ་ཉེས་དམིགས་སུ་ལྟ་བ་མ་ཡིན་ཞིང་ཤིན་ཏུ་སྦྱིན་པ་ལ་མངོན་པར་བརྩོན་ལ་ལག་པ་བརྐྱང་བ་དག་ཡོད་དེ། དེ་དག་སྨོན་ལམ་གྱི་དབང་གིས་ཀླུ་རྣམས་ཀྱི་ནང་དུ་སྐྱེའོ།
en: (1) There are sentient beings who exert themselves in the six perfections and pursue the unsurpassed vehicle but are not quick to regard pleasures as defects, even though they strive in generosity and give freely. Through the power of their aspirations, they will be born among the nāgas.

source: །ཡང་སེམས་ཅན་གང་དག་བླ་ན་མེད་པའི་ཐེག་པ་ཡོངས་སུ་ཚོལ་བའི་སེམས་དང་ལྡན་ཞིང་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་མངོན་པར་བརྩོན་པ་དག་ཡོད་དེ། དེ་དག་གིས་ཚུལ་ཁྲིམས་ཐམས་ཅད་རྫོགས་པར་སྐྱོན་མེད་པར་བསྲུང་བར་ནི་མ་ནུས་སོ། །དེ་དག་སེམས་ཅན་དམྱལ་བ་དང་། ཡི་དགས་ཀྱི་འཇིགས་པས་སྐྲག་ནས་རང་གི་སྨོན་ལམ་གྱིས་ཀླུ་རྣམས་ཀྱི་ནང་དུ་སྐྱེའོ།
en: (2) There are sentient beings who pursue the unsurpassed vehicle and exert themselves in the perfection of generosity but are unable to guard their discipline perfectly and in a faultless manner. Fearing the conditions of the hell beings and pretas, they will be born among the nāgas through their aspirations.

source: །ཡང་སེམས་ཅན་གང་དག་བླ་ན་མེད་པའི་ཐེག་པ་ཡོངས་སུ་ཚོལ་བར་བྱེད་ཅིང་ཤིན་ཏུ་ང་རྒྱལ་གྱིས་ཁེངས་པ་དག་ཡོད་དེ། དེ་དག་ང་རྒྱལ་གྱི་མཐུས་རང་གི་སྨོན་ལམ་གྱིས་ཀླུ་རྣམས་ཀྱི་ནང་དུ་སྐྱེའོ།
en: (3) There are sentient beings who pursue the unsurpassed vehicle but are filled with intense pride. Due to the power of this pride, they will be born among the nāgas through their aspirations.

source: །ཡང་སེམས་ཅན་གང་དག་བླ་ན་མེད་པའི་ཐེག་པའི་སྤྱོད་པ་ལ་མངོན་པར་བརྩོན་པ་དག་ཡོད་དེ། དེ་དག་ཤིན་ཏུ་ཁྲོ་བ་མང་ཞིང་སེམས་ཅན་གཞན་རྣམས་ལ་རབ་ཏུ་སྡང་སྟེ། དེ་དག་ཤ་ཁོན་ལ་རྟེན་པས་འཆི་བའི་དུས་ཐ་མར་ཀླུ་རྣམས་ཀྱི་ནང་དུ་སྨོན་ལམ་འདེབས་ཏེ། དེ་དག་སྨོན་ལམ་གྱིས་དེར་སྐྱེའོ།
en: (4) There are sentient beings who exert themselves in the conduct of the unsurpassed vehicle but have a lot of aggression in them and are extremely hostile toward others. Due to the feelings of enmity they entertain, they will form the wish to be born among the nāgas just before they die. They will thus be born there through their aspirations.

source: །ཡང་སེམས་ཅན་གང་དག་ཉན་ཐོས་ཀྱི་ཐེག་པ་དང་ཡང་དག་པར་ལྡན་ཞིང་སྣོད་དུ་གྱུར་པའི་སྦྱིན་གནས་ཡོངས་སུ་བཙལ་བ་དང་མཆོད་པའི་སེམས་དང་ལྡན་པ་དག་ཡོད་དེ། དེ་དག་རང་གི་སྨོན་ལམ་གྱིས་ཀླུ་རྣམས་ཀྱི་ནང་དུ་སྐྱེའོ།
en: (5) There are sentient beings who genuinely follow the vehicle of the hearers, search for those who are worthy of gifts, and are endowed with an attitude of worship. They may also be born among the nāgas through their own aspirations.

source: །ཡང་སེམས་ཅན་གང་དག་སེར་སྣ་ཅན་དང་ང་རྒྱལ་གྱི་སྐྱོན་དང་ལྡན་པ་དག་ཡོད་དེ། དེ་དག་ལས་དེས་ཀླུ་རྣམས་ཀྱི་ནང་དུ་སྐྱེའོ།
en: (6) There are sentient beings who possess the defects of miserliness and pride. They will be born among the nāgas through their actions.

source: །ཡང་སེམས་ཅན་གང་དག་ང་རྒྱལ་ལ་མངོན་པར་དགའ་ཞིང་མུ་ཅོར་སྨྲ་ལ་བརྫུན་དུ་སྨྲ་བ་དག་ཡོད་དེ། དེ་དག་ལས་དེས་ཀླུ་རྣམས་ཀྱི་ནང་དུ་སྐྱེའོ།
en: (7) There are sentient beings who delight in pride, talk nonsense, and lie. They will be born among the nāgas through their actions.

source: །ཡང་སེམས་ཅན་གང་དག་སངས་རྒྱས་ལ་གཅེས་པར་བྱེད་པ་མ་ཡིན་པ་མང་བ་དག་ཡིན་ཞིང་། ཆོས་དང་། དགེ་འདུན་དང་། བསླབ་པ་དང་། མཁན་པོ་དང་། སློབ་དཔོན་དང་། བླ་མའི་གནས་ལྟ་བུ་དང་། ཕ་མ་རྣམས་ལ་གཅེས་པར་བྱེད་པ་མ་ཡིན་པ་མང་བ་དག་ཡིན་པ་ཡོད་དོ།
en: (8) There are many sentient beings who do not revere the Buddha, the Dharma, the Saṅgha, the precepts, the preceptors, the teachers, the ones who should be respected, and their parents. Due to pride and the delusion induced by inferior actions of body, speech, and mind, they will be born among the nāgas.

source: །དེའི་ཚེ་དེ་དག་ང་རྒྱལ་གྱི་རྒྱུ་དང་། ལུས་དང་། ངག་དང་། ཡིད་ཆུང་ངུས་འཁྲུལ་པས་ཀླུ་རྣམས་ཀྱི་ནང་དུ་སྐྱེའོ།
en: (9) There are sentient beings who, overwhelmed by pride and ignorance, lack control and do not behave faultlessly. They will be born among the nāgas.

source: །ཡང་སེམས་ཅན་གང་དག་ང་རྒྱལ་དང་། གཏི་མུག་གིས་ཟིལ་གྱིས་ནོན་ཅིང་མ་དུལ་ལ་སྐྱོན་མེད་པ་མ་ཡིན་པར་སྤྱོད་པ་དག་ཡོད་དེ། དེ་དག་ཀླུ་རྣམས་ཀྱི་ནང་དུ་སྐྱེའོ། །ཡང་སེམས་ཅན་གང་དག་ང་རྒྱལ་དང་། ཕྲ་མ་སྨྲ་བ་དང་། ཚིག་རྩུབ་པོ་སྨྲ་བ་ལ་གོམས་པ་དག་ཡོད་དེ།
en: (10) Finally, there are sentient beings who are proud and who are used to slander and to speaking with abusive words.

source: དེ་དག་འཆི་བའི་དུས་བྱས་ནས་ཀླུ་རྣམས་ཀྱི་ནང་དུ་སྐྱེ་སྟེ་བཅུ་པོ་དེ་དག་ཡིན་ནོ།
en: After they die, they will also be born among the nāgas.

source: །ཆོས་གཞན་གསུམ་དང་ལྡན་ན་ཀླུ་རྣམས་ཀྱི་ནང་དུ་སྐྱེའོ།
en: “There are three other circumstances through which one will be born among the nāgas.

source: སེམས་ཅན་གང་དག་ལུས་དང་། ངག་དང་། ཡིད་ཀྱི་ཉེས་པར་སྤྱོད་པ་ཤིན་ཏུ་དམ་པོ་དག་གིས་སེམས་ཅན་དམྱལ་བ་རྣམས་ཀྱི་ནང་དུ་སྐྱེས་པ་དག་ཡོད་དེ།
en: (1) There are sentient beings who are born among hell beings due to extremely severe negative actions of body, speech, and mind.

source: དེ་དག་དེ་ནས་ཤི་འཕོས་ནས་ཉེས་པར་སྤྱོད་པའི་ལྷག་མ་ཆུང་ངུས་ཀླུ་རྣམས་ཀྱི་ནང་དུ་སྐྱེའོ།
en: After they die, they will be born among the nāgas due to a small residue of those negative actions.

source: །དེ་བཞིན་དུ་དུད་འགྲོ་རྣམས་དང་། དེ་བཞིན་དུ་ཡི་དགས་རྣམས་ནས་ཞེས་བྱ་བའི་བར་དུ་སྟེ།
en: The same concerns the births among (2) animals and (3) pretas.

source: ཆོས་གསུམ་པོ་དེ་དག་གིས་སེམས་ཅན་རྣམས་ཀླུ་རྣམས་ཀྱི་ནང་དུ་སྐྱེའོ།
en: Through those three circumstances, one will be born among the nāgas.”

source: །རྒྱ་མཚོས་ཀྱང་གསོལ་པ། བཙུན་པ་བཅོམ་ལྡན་འདས་དེ་དེ་བཞིན་ནོ།
en: Sāgara said, “Respected Blessed One, that is correct!

source: །བཙུན་པ་བདེ་བར་གཤེགས་པ་དེ་དེ་བཞིན་ཏེ།
en: Respected Well-Gone One, that is correct!

source: བཙུན་པ་བཅོམ་ལྡན་འདས་འདི་ན་ཀླུ་གང་དག་ལོངས་སྤྱོད་པ་དང་། ཉེ་བར་སྤྱོད་པའི་དཔལ་དང་ལྡན་པ་ལྷ་དང་འདྲ་བ་དག་མཆིས་པ་ནས་མི་སྨད་རིམས་དང་འདྲ་བ་དག་མཆིས་པའི་བར་དང་། ཡི་དགས་དང་འདྲ་བ་དག་མཆིས་པའི་བར་དང་། གང་དག་དུད་འགྲོའི་སྐྱེ་གནས་པ་དང་འདྲ་བ་དག་མཆིས་པའི་བར་ནས་ཀླུ་གང་དག་སེམས་ཅན་དམྱལ་བ་དང་འདྲ་བ་དག་གི་བར་མཆིས་ལགས་ཏེ།
en: Respected Blessed One, there are nāgas in this place who have an abundance of possessions and enjoyments and are like gods, while others are like wretched humans struck by plague, like pretas, animals, or even hell beings.

source: དེ་དག་སྡུག་བསྔལ་གྱི་ཚོར་བ་མྱོང་བར་འགྱུར་ལགས་སོ།
en: They experience terrible suffering!”

source: །དེ་ནས་ཀླུའི་རྒྱལ་པོའི་བུ་པད་མའི་གདོང་ཞེས་བྱ་བས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བདག་སུ་ག་ལས་གང་གིས་ཀླུའི་རིགས་སུ་སྐྱེས་ནས་གཟུགས་མཆོག་ཏུ་ལྷམ་མེ་ཞིང་ལུས་ཀྱིས་རེག་པ་གང་ཆུང་ཟད་ཅི་རེག་ཀྱང་ཀུན་ཏུ་ཚིག་ཅིང་འབར་བ་ལགས།
en: The nāga prince named Lotus Face then asked, “Which actions have led me to be born within a family of nāgas and with a blazing body? Everything I touch with my body—even with the slightest brush—burns and is consumed by flames.

source: བདག་དུས་ཐམས་ཅད་དུ་མཆིལ་ལྷམ་བོར་ནས་གཅེར་བུར་རྒྱུ་བར་བགྱིད་ལགས།
en: I must always walk without sandals and move around naked.

source: བདག་གི་ཕ་མ་དེ་ནི་དཔལ་ཕུན་སུམ་ཚོགས་པའི་ཆེས་ཁྱད་པར་དུ་འཕགས་པ་མྱོང་སྟེ། དཔེར་ན་གླིང་བཞི་པའི་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་བཞིན་ལགས།
en: My parents enjoy perfect prosperity and an exalted status, similar to that experienced by universal monarchs ruling over the four continents.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: The Blessed One replied,

source: ཀྱེ་ལག་འགྲོ་སྔོན་བྱུང་བ་འདས་པའི་དུས་བསྐལ་པ་སུམ་ཅུ་རྩ་གཅིག་འདས་པ་དེའི་ཚེ་དེའི་དུས་ན། དེ་བཞིན་གཤེགས་པ་ཞེས་བྱ་བ་ནས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཞེས་བྱ་བའི་བར་གཙུག་ཏོར་ཅན་ཞེས་བྱ་བ་འཇིག་རྟེན་དུ་བྱུང་ངོ་།
en: “O, nāga! In the past, thirty-one eons ago, the thus-gone, worthy, perfect Buddha, blessed Śikhin, appeared in the world.

source: །དེའི་ཚེ་རྒྱལ་པོ་མེ་ཏོག་བྲལ་ཞེས་བྱ་བ་ཞིག་བྱུང་སྟེ།
en: At that time, there was a king named Free of Flowers.

source: རྒྱལ་པོ་མེ་ཏོག་བྲལ་དེས་ཀྱང་དེ་བཞིན་གཤེགས་པ་གཙུག་ཏོར་ཅན་ཉན་ཐོས་དང་། བྱང་ཆུབ་སེམས་དཔའི་དགེ་འདུན་བརྒྱ་སྟོང་ཕྲག་མང་པོའི་འཁོར་དང་ལྡན་པ་དེ་ལ་ཟླ་བ་གསུམ་དུ་ཡོ་བྱད་ཐམས་ཅད་ཕུལ་ནས་རྟག་ཏུ་ཆོས་མཉན་ཏེ།
en: For three months, he offered all sorts of supplies to the thus-gone Śikhin and his retinue—saṅghas of hearers and bodhisattvas counting many hundreds of thousands of members—and he listened to the Dharma continuously.

source: བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སྨོན་ལམ་བཏབ་བོ།
en: He made the aspiration to reach unsurpassed and perfect awakening.

source: །བཅོམ་ལྡན་འདས་དེའི་གཙུག་ལག་ཁང་ཡོ་བྱད་ཐམས་ཅད་དང་ལྡན་པ་ཞིག་ཀྱང་བརྩིགས་སོ།
en: He also built the Blessed One a fully functional temple.
